{
  "apple scab": "Apple scab causes dark, scabby spots on leaves and fruits. Prune affected areas and apply fungicides like Captan or Mancozeb early in the season.",
  "black rot apple": "Black rot appears as dark brown circular spots on leaves and fruits. Remove infected leaves and treat with copper-based fungicides.",
  "cedar apple rust": "Orange or rust-colored spots on apple leaves. Break the apple-cedar infection cycle by removing nearby juniper plants and using fungicides.",
  "tomato late blight": "Late blight causes dark, water-soaked lesions on leaves. Use resistant varieties, avoid overhead watering, and apply fungicides promptly.",
  "tomato early blight": "Characterized by concentric rings on leaves. Remove infected leaves and rotate crops annually. Apply chlorothalonil or mancozeb fungicides.",
  "tomato leaf mold": "Yellow patches turning brown with fuzzy mold underneath. Improve air circulation and use copper-based sprays.",
  "tomato yellow leaf curl virus": "Leads to upward curling, yellowing, and stunted growth. Control whiteflies and remove infected plants.",
  "tomato spider mites": "Fine webbing and yellow specks on leaves. Use insecticidal soap or neem oil and keep the plant well-hydrated.",
  "tomato target spot": "Irregular brown lesions with a yellow halo. Treat with chlorothalonil and remove affected leaves.",
  "tomato septoria leaf spot": "Small circular spots with dark borders on lower leaves. Prune and apply fungicides like copper.",
  "tomato bacterial spot": "Dark, greasy lesions on leaves and fruit. Use copper-based fungicides and avoid wetting foliage.",
  "tomato mosaic virus": "Light and dark green mottling, leaf curl, and reduced fruit size. Remove infected plants and disinfect tools.",
  "grape black rot": "Brown circular spots and fruit mummification. Prune infected parts and apply fungicides like myclobutanil.",
  "grape esca": "Also known as black measles. Causes interveinal yellowing, brown patches, and vine decline. No chemical cure exists.",
  "grape leaf blight": "Causes brown, wedge-shaped lesions starting from leaf edges. Improve air circulation and remove debris.",
  "peach bacterial spot": "Small water-soaked spots on leaves and fruit. Avoid overhead watering, apply copper sprays, and use resistant cultivars.",
  "potato early blight": "Dark lesions with concentric rings on older leaves. Rotate crops and apply protectant fungicides early.",
  "potato late blight": "Brown spots on leaves and tubers, rapid plant collapse. Use certified seed, destroy infected plants, and apply systemic fungicides.",
  "corn rust": "Reddish-brown pustules on leaves. Plant resistant hybrids and apply fungicides if infection is severe.",
  "corn northern leaf blight": "Long, gray-green lesions on lower leaves. Rotate crops and apply fungicide at early signs.",
  "corn cercospora leaf spot": "Small tan lesions that coalesce. Practice crop rotation and residue management.",
  "corn common rust": "Round, cinnamon-brown pustules. Manage with resistant varieties and timely fungicide application.",
  "corn gray leaf spot": "Narrow rectangular lesions. Control with crop rotation, tillage, and fungicides.",
  "squash powdery mildew": "White powdery growth on both leaf surfaces. Improve airflow, water at the base, and apply sulfur or neem oil.",
  "bell pepper bacterial spot": "Dark, sunken spots on leaves and fruits. Use disease-free seeds, copper fungicides, and avoid working with wet plants.",
  "strawberry leaf scorch": "Reddish-brown leaf edges and small black spots. Use resistant varieties, remove infected leaves, and ensure good air circulation.",
  "raspberry cane blight": "Dark cankers at the base of canes. Prune infected stems and improve air circulation.",
  "soybean rust": "Reddish-brown pustules under leaves. Monitor closely and use rust-resistant varieties.",
  "orange citrus greening": "Yellow shoots, lopsided fruit, and bitter taste. No cure exists—remove infected trees and control psyllid vectors.",
  "preventive care tips": "Use clean tools, rotate crops, space plants for airflow, and remove weeds. Monitor regularly and act quickly on early symptoms.",
  "general plant care": "Water deeply but less frequently, use compost-rich soil, avoid overhead watering, and prune regularly to prevent disease buildup.",
  "healthy plant": "Your plant appears healthy! Maintain consistent care with proper watering, sunlight, spacing, and periodic inspection for early disease signs.",
  "tomato diseases": "Tomato can suffer from late blight, early blight, target spot, septoria leaf spot, bacterial spot, leaf mold, and mosaic virus.",
  "grape diseases": "Grapes are prone to black rot, esca (black measles), and leaf blight. Prune regularly and apply fungicides as needed.",
  "corn diseases": "Common diseases include rust, gray leaf spot, northern leaf blight, and cercospora leaf spot. Rotate crops and scout early.",
  "apple diseases": "Watch for apple scab, black rot, and cedar apple rust. Fungicide and pruning are key control methods.",
  "potato diseases": "Potatoes can be affected by early and late blight. Use certified seed and apply protectants during wet weather.",
  "show tomato diseases": "To see a list of tomato diseases, try typing 'Show tomato diseases'.",
  "show apple diseases": "Try asking 'Show apple diseases' to view apple-related problems."
}
